#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u043B\u044C\u043D\u043E\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435.
@class#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u043B\u044C\u043D\u043E\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435. \
    <p/>\u041A\u043E\u0434 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0437\u0430\u0434\u0430\u0435\u0442\u0441\u044F \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>actionExpression</b>. \u0420\u0430\u0437\u0440\u0435\u0449\u0435\u043D\u043E \u0438\u043B\u0438 \u0437\u0430\u043F\u0440\u0435\u0449\u0435\u043D\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \
    \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043E\u043F\u0435\u0440\u0435\u0434\u0435\u043B\u044F\u0442\u0441\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u043C <b>actionEnabled</b>. \u0422\u0435\u043A\u0441\u0442, \u043E\u043F\u0438\u0441\u044B\u0432\u0430\u044E\u0449\u0438\u0439 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435, \
    \u0437\u0430\u0434\u0430\u0435\u0442\u0441\u044F \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430\u0445: <b>enabledActionText</b>, <b>disabledActionText</b> \
    <p/>\
    \u0414\u043B\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 <i>actionExpression, actionEnabled, enabledActionText, disabledActionText</i> \
    \u043C\u043E\u0433\u0443\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F:\
    <ul>\
    <li><b>refreshAttributes</b> (Map<String, NodeAttribute>) - \u0441\u043F\u0438\u0441\u043E\u043A \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F<li> \
    </ul>

actionExpression#description \u041A\u043E\u0434 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C
actionEnabled#description \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>false</b> \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u0442 \u0447\u0442\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0437\u0430\u043F\u0440\u0435\u0449\u0435\u043D\u043E. \u0412 \u044D\u0442\u043E\u043C \
    \u0441\u043B\u0443\u0447\u0430\u0435 \u0432\u043E \u0432\u043A\u043B\u0430\u0434\u043A\u0435 <b>\u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440</b> \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442\u0441\u044F \u0442\u0435\u043A\u0441\u0442 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u043C\u044B\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u043C <b>disabledActionText</b>. \
    <p/>\
    \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>true</b> \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u043D\u0438 \u0447\u0442\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043E. \u0412 \u044D\u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u0432\u043E \u0432\u043A\u043B\u0430\u0434\u043A\u0435 \u043F\u0440\u043E\u0441\u043C\u043E\u0442\u0440 \
    \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442\u0441\u044F \u043B\u0438\u043D\u043A \u0441 \u0442\u0435\u043A\u0441\u0442\u043E\u043C \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u043C \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>enabledActionText</b>
enabledActionText#description \u0421\u043C\u043E\u0442\u0440\u0438 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044E \u043A <b>actionEnabled</b>
disabledActionText#description \u0421\u043C\u043E\u0442\u0440\u0438 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044E \u043A <b>actionEnabled</b>
confirmationMessage#description \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0437\u0430\u0434\u0430\u043D\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u043F\u0435\u0440\u0435\u0434 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435\u043C \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u043F\u043E\u044F\u0432\u0438\u0442\u0441\u044F \u0434\u0438\u0430\u043B\u043E\u0433 \
    \u0441 \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u0435\u043C \u043D\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0441 \u0442\u0435\u043A\u0441\u0442\u043E\u043C \u0432\u0437\u044F\u0442\u044B\u043C \u0438\u0437 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430