#  Copyright 2008 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0442\u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0437\u0430\u0434\u0430\u043D\u043D\u0443\u044E \u0432\u0435\u0442\u043A\u0443 \u0434\u0435\u0440\u0435\u0432\u0430 \u043D\u0430 \u043F\u0440\u0435\u0434\u043C\u0435\u0442 \u0443\u0437\u043B\u043E\u0432, \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u044E\u0449\u0438\u0445 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u043C\u0443 \u0443\u0441\u043B\u043E\u0432\u0438\u044E, \u0438 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u044C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u0432 \u0432\u0438\u0434\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
@class#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0442\u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0437\u0430\u0434\u0430\u043D\u043D\u0443\u044E \u0432\u0435\u0442\u043A\u0443 \u0434\u0435\u0440\u0435\u0432\u0430 \u043D\u0430 \u043F\u0440\u0435\u0434\u043C\u0435\u0442 \u0443\u0437\u043B\u043E\u0432, \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u044E\u0449\u0438\u0445 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u043C\u0443 \u0443\u0441\u043B\u043E\u0432\u0438\u044E, \u0438 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u044C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u0432 \u0432\u0438\u0434\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B

startingPoint#description \u0423\u0437\u0435\u043B \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435
scheduler#description \u041F\u043B\u0430\u043D\u0438\u0440\u043E\u0432\u0449\u0438\u043A \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0442\u044C \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043F\u043E \u0440\u0430\u0441\u043F\u0438\u0441\u0430\u043D\u0438\u044E
subtreeFilter#description \u0415\u0441\u043B\u0438 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0432\u0435\u0440\u043D\u0435\u0442 false \u0434\u043B\u044F \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u043A\u0430\u043D\u0438\u0440\u0443\u0435\u043C\u043E\u0433\u043E \u0443\u0437\u043B\u0430 (scanningNode), \u0442\u043E\u0433\u0434\u0430 \u0443\u0437\u0435\u043B \u0438 \u0432\u0441\u0435 \u0435\u0433\u043E \u0434\u043E\u0447\u0435\u0440\u043D\u0438\u0435 \u0443\u0437\u043B\u044B (\u0432\u0435\u0442\u043A\u0430) \u0431\u0443\u0434\u0443\u0442 \u0438\u0441\u043A\u043B\u044E\u0447\u0435\u043D\u044B \u0438\u0437 \u0441\u043A\u0430\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F
nodeFilter#description \u0415\u0441\u043B\u0438 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0432\u0435\u0440\u043D\u0435\u0442 true \u0434\u043B\u044F \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u043A\u0430\u043D\u0438\u0440\u0443\u0435\u043C\u043E\u0433\u043E \u0443\u0437\u043B\u0430 (scanningNode), \u0442\u043E\u0433\u0434\u0430 \u0443\u0437\u0435\u043B \u0431\u0443\u0434\u0435\u0442 \u0432\u043A\u043B\u044E\u0447\u0435\u043D \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443. \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F: scanningNode 
nodeWeight#description \u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u044E\u0449\u0435\u0435 \u0432\u0435\u0441 \u0443\u0437\u043B\u0430 \u043F\u043E \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u044E \u043A \u0434\u0440\u0443\u0433\u0438\u043C \u0443\u0437\u043B\u0430\u043C. \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F: scanningNode 
sortByNodeWeight#description \u0415\u0441\u043B\u0438 true \u0442\u043E\u0433\u0434\u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0430\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u0431\u0443\u0434\u0435\u0442 \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0430 \u043F\u043E \u0432\u0435\u0441\u0443 \u0443\u0437\u043B\u0430 (\u0441\u043C. nodeWeightExpression)
reverseOrder#description \u0415\u0441\u043B\u0438 true \u0442\u043E\u0433\u0434\u0430 \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0430 (\u0441\u043C. sortByNodeWeight) \u0431\u0443\u0434\u0435\u0442 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0442\u044C\u0441\u044F \u0432 \u043E\u0431\u0440\u0430\u0442\u043D\u043E\u043C \u043F\u043E\u0440\u044F\u0434\u043A\u0435.
maxRowCount#description \u041E\u0433\u0440\u0430\u043D\u0438\u0447\u0438\u0432\u0430\u0435\u0442 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435
includeAdditionalNodes#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0432\u043A\u043B\u044E\u0447\u0438\u0442\u044C \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u0443\u0437\u043B\u044B. \u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u043C\u043E\u0436\u0435\u0442 \u0432\u0435\u0440\u043D\u0443\u0442\u044C: null, \u0443\u0437\u0435\u043B, \u043C\u0430\u0441\u0441\u0438\u0432 \u0443\u0437\u043B\u043E\u0432, \u043A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044E \u0443\u0437\u043B\u043E\u0432. \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F: scanningNode 
excludeScannedNode#description \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 true \u0442\u043E\u0433\u0434\u0430 \u0441\u043A\u0430\u043D\u0438\u0440\u0443\u0435\u043C\u044B\u0439 \u0443\u0437\u0435\u043B \u043D\u0435 \u043F\u043E\u043F\u0430\u0434\u0435\u0442 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443, \u0442.\u0435. \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0431\u0443\u0434\u0443\u0442 \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0443\u0437\u043B\u044B \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435\u043C includeAdditionalNodes.
