# Copyright 2014 Mikhail Titov.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

@class \u0424\u043e\u0440\u043c\u0438\u0440\u043e\u0443\u0435\u0442 \u043e\u0442\u0432\u0435\u0442 \u043d\u0430 \u0437\u0430\u043f\u0440\u043e\u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430
@class#description \u0424\u043e\u0440\u043c\u0438\u0440\u043e\u0443\u0435\u0442 \u043e\u0442\u0432\u0435\u0442 \u043d\u0430 \u0437\u0430\u043f\u0440\u043e\u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f \u0437\u0430\u0447\u0435\u043d\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 (\u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442 \u0441\u043a\u0440\u0438\u043f\u0442). \
  <p>\u0421\u043f\u043e\u0441\u043e\u0431\u044b \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u044f:\
  <ul>\
  <li>\u0412\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f(\u0432\u044b\u0447\u0438\u0441\u043b\u0435\u043d\u0438\u0439) \u0441\u043e\u043e\u0442\u0432\u0435\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043b\u043e\u0433\u0438\u043a\u0435 \u0437\u0430\u043f\u0440\u043e\u0441\u0430. \u0424\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043e\u0442\u0432\u0435\u0442\u0430 (\u043e\u0431\u044b\u0447\u043d\u043e \u044d\u0442\u043e \u0434\u0430\u043d\u043d\u044b\u0435 \
      \u0443\u043f\u0430\u043a\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u0432 json, xml \u0438 \u0442.\u0434.) \
  <li>\u0412\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044f(\u0432\u044b\u0447\u0438\u0441\u043b\u0435\u043d\u0438\u0439) \u0441\u043e\u043e\u0442\u0432\u0435\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043b\u043e\u0433\u0438\u043a\u0435 \u0437\u0430\u043f\u0440\u043e\u0441\u0430. \u0420\u0435\u043d\u0434\u0435\u0440\u0438\u043d\u0433 \u043e\u0442\u0432\u0435\u0442\u0430 \u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435\u043c \u0448\u0430\u0431\u043b\u043e\u043d\u0430 \
      (FileResponseBuilderNode) \
  <li>\
  </ul>\
  <p>\u0412 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f \u043e\u0442\u0432\u0435\u0442\u0430 (<b>responseContent</b>) \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043e\u043a\u0440\u0443\u0436\u0435\u043d\u0438\u044f: \
  <ul>\
  <li><b>userContext</b> (org.raven.auth.UserContext) - \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044f, \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0432\u0448\u0435\u0433\u043e \u0437\u0430\u043f\u0440\u043e\u0441\
  <li><b>request</b> (org.raven.net.Request) - \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e \u0437\u0430\u043f\u0440\u043e\u0441\u0435\
  <li><b>response</b> (org.raven.net.ResponseContext) - \u043e\u0431\u044a\u0435\u043a\u0442 \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u043e\u0442\u0432\u0435\u0442\
  <li><b>rootPath</b> (java.lang.String) - \u041f\u0443\u0442\u044c \u0434\u043e \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u044b Raven \u043d\u0430 web \u0441\u0435\u0440\u0432\u0435\u0440\u0435. \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440,  \
       \u0434\u043b\u044f \u043f\u0443\u0442\u0438 <b>http://some.host.name/raven/projects/some/context</b> \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435\u043c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u0431\u0443\u0434\u0435\u0442 <b>/raven</b>\
  <li><b>appNode</b> (org.raven.tree.Node) - \u0434\u043b\u044f \u043f\u0440\u043e\u0435\u043a\u0442\u0430 \u044d\u0442\u043e \u0431\u0443\u0434\u0435\u0442 \u0443\u0437\u0435\u043b (WebInterfaceNode), \u0434\u043b\u044f \u0433\u043b\u043e\u0431\u0430\u043b\u044c\u043d\u044b\u0445 \u0437\u0430\u043f\u0440\u043e\u0441\u043e\u0432 \
      (NeworkResponseServiceNode)\
  </li><b>appPath</b> (java.lang.String) - \u041f\u0443\u0442\u044c \u0434\u043e \u043f\u0440\u043e\u0435\u043a\u0442\u0430. \u0414\u043b\u044f \u043f\u0440\u0438\u043c\u0435\u0440\u0430 \u0432\u044b\u0448\u0435 \u044d\u0442\u043e \u0431\u0443\u0434\u0435\u0442 /raven/projects/some/context</b> it returns <b>/raven</b> \
  </li><b>contextPath</b> (java.lang.String) - \u041f\u0443\u0442\u044c \u0434\u043e \u043a\u043e\u043d\u0435\u043a\u0441\u0442\u0430. \u0414\u043b\u044f \u043d\u0430\u0448\u0435\u0433\u043e \u043f\u0440\u0438\u043c\u0435\u0440\u0430 \u0432\u044b\u0448\u0435 \u044d\u0442\u043e \u0431\u0443\u0434\u0435\u0442 some/context</b> it returns <b>/raven</b> \
  </ul>\
   <p>\u0422\u0430\u043a \u0436\u0435 \u043f\u0440\u0438 \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0438 \u043e\u0442\u0432\u0435\u0442\u0430 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u0444\u0443\u043d\u043a\u0446\u0438\u0438: \
   <ul>\
   <li><i>java.lang.String</i> <b>path</b>(<i>org.raven.tree.Node</i> path) - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442 http \u043f\u0443\u0442\u044c \
       \u0434\u043e \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u0443\u0437\u043b\u0430 \u043e\u0442 "\u043a\u043e\u0440\u043d\u044f" web \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \
       \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0434\u043b\u044f \u0443\u0437\u043b\u0430 /"Projects"/"test"/"Web interface"/"action1"/, \u043f\u0440\u0438 \u0443\u0441\u043b\u043e\u0432\u0438\u0438, \u0447\u0442\u043e \u043f\u0443\u0442\u044c \u0434\u043e \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u044b "raven", \
       \u043f\u043e\u043b\u0443\u0447\u0438\u043c "/raven/projects/test/action1". \
   <li><i>java.lang.String</i> <b>path</b>(<i>java.lang.String</i> path) - \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442 http \u043f\u0443\u0442\u044c \u043f\u0443\u0442\u0435\u043c \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u044f \
       \u043a <b>rootPath</b> \
       (\u043f\u0443\u0442\u044c \u0434\u043e \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u044b Raven \u043d\u0430 web \u0441\u0435\u0440\u0432\u0435\u0440\u0435) \u043f\u0443\u0442\u0438, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u0433\u043e \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435. \
       \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0435\u0441\u043b\u0438 \u0432 \u0444\u0443\u043d\u043a\u0446\u0438\u044e \u043f\u0435\u0440\u0435\u0434\u0430\u0442\u044c <code>projects/test/action1</code> \u0438 \u043f\u0440\u0438 \u0443\u0441\u043b\u043e\u0432\u0438\u0438, \u0447\u0442\u043e \u043f\u0443\u0442\u044c \u0434\u043e \u043f\u043b\u0430\u0442\u0444\u043e\u0440\u043c\u044b "raven", \
       \u043f\u043e\u043b\u0443\u0447\u0438\u043c "/raven/projects/test/action1". \
   <li><i>org.raven.net.Result</i> <b>render</b>(<i>org.raven.net.FileResponseBuilder</i> template) \u0440\u0435\u043d\u0434\u0435\u0440\u0438\u0442 \
      \u0448\u0430\u0431\u043b\u043e\u043d, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435\
   <li><i>org.raven.net.Result</i> <b>render</b>(<i>int</i> statusCode, <i>org.raven.net.FileResponseBuilder</i> template) \u0440\u0435\u043d\u0434\u0435\u0440\u0438\u0442 \
      \u0448\u0430\u0431\u043b\u043e\u043d, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <i>template</i> \u0441 http \u0441\u0442\u0430\u0442\u0443\u0441\u043e\u043c, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u043e\u043c \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 <i>statusCode</i>\
   <li><i>org.raven.net.Result</i> <b>render</b>(<i>int</i> statusCode, <i>org.raven.net.FileResponseBuilder</i> template, <i>java.util.Map</i> params) \
      \u0414\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0430\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u044f, \u043f\u043b\u044e\u0441, \u043f\u0435\u0440\u0435\u0434\u0430\u0435\u0442 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0432 \u0448\u0430\u0431\u043b\u043e\u043d. \
   <li><i>org.raven.net.RedirectResult</i> <b>redirect</b>(<i>String</i> url) - "\u0434\u0435\u043b\u0430\u0435\u0442" \u0440\u0435\u0434\u0438\u0440\u0435\u043a\u0442 \u043d\u0430 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \
       URL (http status 302, MOVED_TEMPORARILY) \
   <li><i>org.raven.net.RedirectResult</i> <b>redirect</b>(<i>String</i> url) - "\u0434\u0435\u043b\u0430\u0435\u0442" \u0440\u0435\u0434\u0438\u0440\u0435\u043a\u0442 \u043d\u0430 \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \
       \u0443\u0437\u0435\u043b (http status 302, MOVED_TEMPORARILY). URL \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u0435\u0439 <b>path</b>(org.raven.tree.Node) \
   <li><i>org.raven.net.Result</i> <b>result</b>(<i>Object</i> content) - \u0440\u0435\u043d\u0434\u0435\u0440\u0438\u0442 \u043a\u043e\u043d\u0442\u0435\u043d\u0442, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 \
      c http \u0441\u0442\u0430\u0442\u0443\u0441\u043e\u043c 200 \u0438 mime type, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u043c \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>responseContentType</b>, \u0438 \u043a\u043e\u0434\u0438\u0440\u043e\u0432\u043a\u043e\u0439, \u0437\u0430\u0434\u0430\u043d\u043d\u043e\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 \
      <b>responseContentCharset</b>\
   <li><i>org.raven.net.Result</i> <b>result</b>(<i>int</i> statusCode, <i>Object</i> content) - \u0434\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0430\u044f \
      \u0444\u0443\u043d\u043a\u0446\u0438\u044f \u043d\u043e http \u0441\u0442\u0430\u0442\u0443\u0441 \u0431\u0435\u0440\u0435\u0442\u0441\u044f \u0438\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>statusCode</b>\
   <li><i>org.raven.net.Result</i> <b>result</b>(<i>int</i> statusCode, <i>String</i> mimeType, <i>Object</i> content) - \u0434\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0430\u044f \
      \u0444\u0443\u043d\u043a\u0446\u0438\u044f \u043d\u043e \u0442\u0438\u043f \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430 (mime type) \u0431\u0435\u0440\u0435\u0442\u0441\u044f \u0438\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>mimeType</b>\
   <li><b>throwHttpError</b>(<i>Object</i> content) - \u0432\u043e\u0437\u0431\u0443\u0436\u0434\u0430\u0435\u0442 \u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0443\u044e \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044e (exception) \u043d\u0430 \u043e\u0441\u043d\u043e\u0432\u0435 \u043a\u043e\u0442\u043e\u0440\u043e\u0439 \
      \u0431\u0443\u0434\u0435\u0442 \u0441\u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d \u043e\u0442\u0432\u0435\u0442 \u0441 \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u044b\u043c, \u0443\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u043c \u0432 <b>content</b>, http \u0441\u0442\u0430\u0442\u0443\u0441\u043e\u043c <i>400</i> \
      \u0438 \u0442\u0438\u043f\u043e\u043c \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430 <i>text/plain</i>\
   <li><b>throwHttpError</b>(<i>int</i> statusCode, <i>Object</i> content) - \u0434\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0430\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u044f \
      \u043d\u043e http \u0441\u0442\u0430\u0442\u0443\u0441 \u0431\u0435\u0440\u0435\u0442\u0441\u044f \u0438\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>statusCode</b>\
   <li><b>throwHttpError</b>(<i>int</i> statusCode, <i>String</i> contentType, <i>Object</i> content) - \u0434\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0430\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u044f \
      \u043d\u043e http \u0441\u0442\u0430\u0442\u0443\u0441 \u0431\u0435\u0440\u0435\u0442\u0441\u044f \u0438\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>statusCode</b>, \u0430 \u0442\u0438\u043f \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430 \u0438\u0437 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 <b>contentType</b>\
   <li><i>org.raven.net.ResponsePromise</i> <b>sendDataAsync</b>(<i>DataSource</i> source, <i>DataConsumer</i> target, <i>Object</i> data, <i>Closure</i> callback) - \
      \u0418\u043d\u0438\u0446\u0438\u0438\u0440\u0443\u0435\u0442 \u043f\u0440\u043e\u0446\u0435\u0441 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0434\u0430\u043d\u043d\u044b\u0445 <b>data</b> \u043e\u0442 <b>source</b> \u043a <b>target</b>. \u041f\u043e\u0441\u043b\u0435 \u0442\u043e\u0433\u043e \u043a\u0430\u043a \u0434\u0430\u043d\u043d\u044b\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u044e\u0442\u0441\u044f, \
      \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c\u0441\u044f \u0431\u043b\u043e\u043a \u043a\u043e\u0434\u0430 <b>callback</b> \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0439, \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 1-\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043f\u0435\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044f \u0443\u0437\u0435\u043b \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0432\u0448\u0438\u0439 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0443, \
      \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 2-\u0433\u043e \u0434\u0430\u043d\u043d\u044b\u0435, \u043f\u043e\u043b\u0443\u0447\u0438\u0432\u0448\u0438\u0435\u0441\u044f \u043f\u043e\u0441\u043b\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438. \u0420\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u0431\u043b\u043e\u043a\u0430 \u043a\u043e\u0434\u0430 <b>callback</b> \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d \
      \u0434\u043b\u044f \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f \u043e\u0442\u0432\u0435\u0442\u0430. \
   <li><i>org.raven.net.ResponsePromise</i> <b>sendDataAsync</b>(<i>DataSource</i> source, <i>DataConsumer</i> target, <i>DataContext</i> context, <i>Object</i> data, <i>Closure</i> callback) - \
      \u0414\u0435\u043b\u0430\u0435\u0442 \u0442\u043e\u0436\u0435 \u0441\u0430\u043c\u043e\u0435, \u0447\u0442\u043e \u0438 \u043f\u0440\u0435\u0434\u0443\u0434\u0443\u0449\u0430\u044f \u0444\u0443\u043d\u043a\u0446\u0438\u044f, \u043d\u043e \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0434\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 \u043f\u0435\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044f \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0434\u0430\u043d\u043d\u044b\u0445.\
   </ul>
   

responseContentType#description \u0422\u0438\u043f \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u043c\u043e\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430 (mimeType), \u041d\u041e <b>responseContent</b> \u043c\u043e\u0436\u0435\u0442 \u0432\u0435\u0440\u043d\u0443\u0442\u044c \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442 \u0441 \u0434\u0440\u0443\u0433\u0438\u043c \u0442\u0438\u043f\u043e\u043c \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430
responseContentCharset#description \u041a\u043e\u0434\u0438\u0440\u043e\u0432\u043a\u0430 \u043a\u043e\u043d\u0442\u0435\u043d\u0442\u0430
responseContent#description \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u044d\u0442\u043e\u0433\u043e \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0438 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u043e \u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043e\u0442\u0432\u0435\u0442\u0430 \u043d\u0430 \u0437\u0430\u043f\u0440\u043e\u0441 (\u0441\u043c. \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u0443\u0437\u043b\u0430)