#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0411\u0414 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0449\u0430\u044F \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0445\u0440\u0430\u043D\u0438\u043B\u0438\u0449\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 round robin database
@class#description \u0411\u0414 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0449\u0430\u044F \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0445\u0440\u0430\u043D\u0438\u043B\u0438\u0449\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 round robin database. \
    \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E \u0431\u044B \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C\u044E \u0443\u0437\u043B\u0430 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E: \
    <ul>\
    <li>\u0421\u043E\u0437\u0434\u0430\u0442\u044C \u0441\u0445\u0435\u043C\u0443 \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u043F\u043E\u043B\u044F: \
        <ul>\
        <li><b>key</b> (\u0442\u0438\u043F <i>STRING</i>) - \u043A\u043B\u044E\u0447 (\u043F\u0443\u0442\u044C) \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u0434\u0430\u043D\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438 \u0431\u0443\u0434\u0443\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u044B. \
            \u0420\u0430\u0437\u0434\u0435\u043B\u0438\u0442\u0435\u043B\u044C \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u0430 \u043F\u0443\u0442\u0438 <b><font color="blue">/</font></b>\
        </li>\
        <li><b>time</b> (\u0442\u0438\u043F <i>TIMESTAMP</i> \u0438\u043B\u0438 <i>LONG</i>) - \u0432\u0440\u0435\u043C\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u0441\u043E\u043E\u0442\u0432\u0435\u0441\u0442\u0432\u0443\u044E\u0442 \u0434\u0430\u043D\u043D\u044B\u0435 \u0437\u0430\u043F\u0438\u0441\u0438. \
            \u0415\u0441\u043B\u0438 \u0442\u0438\u043F \u043F\u043E\u043B\u044F <i>LONG</i> \u0442\u043E\u0433\u0434\u0430 \u0435\u0433\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0435\u043A\u0443\u043D\u0434 \u043F\u0440\u043E\u0448\u0435\u0434\u0448\u0438\u0445 \u0441 \
            01.01.1970 (unix time)\
        </li>\
        </ul>\
    </li>\
    <li>\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0441\u0445\u0435\u043C\u0443 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u043F\u043E\u043B\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u0442\u044C\u0441\u044F \u0432 \u0411\u0414. \u041A\u0430\u0436\u0434\u043E\u0435 \u0442\u0430\u043A\u043E\u0435 \u043F\u043E\u043B\u0435: \
        <ul>\
        <li>\u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0442\u0438\u043F\u0430 <i>DOUBLE</i></li>\
        <li>\u0434\u043E\u043B\u0436\u043D\u043E \u0438\u043C\u0435\u0442\u044C \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 <i>RrdDatabaseRecordFieldExtension</i> \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0441\u043B\u0430\u0442\u044C\u0441\u044F \
            \u043D\u0430 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 \u0441\u0445\u0435\u043C\u044B <i>RrdDatabaseRecordExtension</i> \
        </li>\
        </ul>\
    </li>\
    <li>\u0420\u0430\u0441\u0448\u0438\u0440\u0438\u0442\u044C \u0441\u0445\u0435\u043C\u0443 \u0437\u0430\u043F\u0438\u0441\u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F <i>RrdDatabaseRecordExtension</i>. \u041D\u0430 \u043A\u0430\u0436\u0434\u043E\u0435 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E\u0435 \u0438\u043C\u044F \
        \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u0435 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <i>databaseTemplateName</i> \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043F\u043E \u043E\u0434\u043D\u043E\u043C\u0443 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u044E \u0441\u0445\u0435\u043C\u044B \
        <i>RrdDatabaseRecordExtension</i> \u0438\u043C\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C \u0441\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435\u043C \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430.\
    </li> \
    <li>\u0421\u0432\u044F\u0437\u0430\u0442\u044C \u0432\u043D\u043E\u0432\u044C \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u0443\u044E \u0441\u0445\u0435\u043C\u0443 \u0441 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u043C <i>recordSchema</i></li> \
    <li>\u041D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0434\u0430\u043D\u043D\u044B\u0445 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0437\u0430\u043F\u0438\u0441\u0438 \u0438 \u0441\u0432\u044F\u0437\u0430\u0442\u044C \u0435\u0433\u043E \u0441 \u0411\u0414 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \
        <i>dataSource</i> \
    </li>\
    <li>\u041D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u0430 (\u0435\u0441\u043B\u0438 \u0432 \u044D\u0442\u043E\u043C \u0435\u0441\u0442\u044C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0441\u0442\u044C, \u0441\u043C. \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043A \u0443\u0437\u043B\u0443 <i>Rules</i>)</li>\
    </ul>\

startTime#description \u0412\u0440\u0435\u043C\u044F, \u043D\u0430\u0447\u0438\u043D\u0430\u044F \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E, \u0432 \u0431\u0430\u0437\u0435 \u0431\u0443\u0434\u0443\u0442 \u0445\u0440\u0430\u043D\u0438\u0442\u044C\u0441\u044F \u0434\u0430\u043D\u043D\u044B\u0435
updateQueue#description \u041E\u0447\u0435\u0440\u0435\u0434\u044C, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0431\u0443\u0434\u0435\u0442 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u043D\u0430 \u0437\u0430\u043F\u0438\u0441\u044C \u0434\u0430\u043D\u043D\u044B\u0445
useLocalTime#description \u0415\u0441\u043B\u0438 <b>TRUE</b> \u0442\u043E\u0433\u0434\u0430 timestamp \u0437\u0430\u043F\u0438\u0441\u0435\u0439, \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0445 \u0432 \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445,\
     \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u0438\u0432\u0435\u0434\u0435\u043D \u043A \u043B\u043E\u043A\u0430\u043B\u044C\u043D\u043E\u043C\u0443 \u0432\u0440\u0435\u043C\u0435\u043D\u0438 (\u0442.\u0435. \u043A timestamp \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u0438\u0431\u0430\u0432\u043B\u0435\u043D \u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u0441\u0434\u0432\u0438\u0433)