#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043A\u0435\u0448\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430
@class#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0437\u0430\u043A\u0435\u0448\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430. \u041F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u043F\u0435\u0440\u0435\u0434\u0430\u044E\u0442\u0441\u044F \u0434\u0430\u043D\u043D\u044B\u0435 \u0438\u0437 \u043A\u0435\u0448\u0430. \
    \u0414\u0430\u043D\u043D\u044B\u0435 \u0432 \u043A\u0435\u0448\u0435 \u043E\u0431\u043D\u043E\u0432\u043B\u044F\u044E\u0442\u0441\u044F \u0432 \u0442\u043E\u043C \u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u0435\u0441\u043B\u0438: \
    <ul> \
    <li>\u0414\u0430\u043D\u043D\u044B\u0435 \u0432 \u043A\u0435\u0448\u0435 \u0443\u0441\u0442\u0430\u0440\u0435\u043B\u0438 (<i>expirationTime</i>)</li> \
    <li>\u0414\u0430\u043D\u043D\u044B\u0435 \u0437\u0430\u043F\u0440\u0430\u0448\u0438\u0432\u0430\u044E\u0442\u0441\u044F <i>\u0430\u043A\u0442\u0438\u0432\u043D\u044B\u043C</i> \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u0435\u043C (\u0442.\u0435. \u0443 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \
        <i>activeConsumer</i> \u0438\u043C\u0435\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>TRUE</b>)</li> \
    </ul>

cacheScope#description
waitTimeout#description \u0418\u043D\u0442\u0435\u0440\u0432\u0430\u043B \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u0432 \u043C\u0438\u043B\u0438\u0441\u0435\u043A\u0443\u043D\u0434\u0430\u0445 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C \u0431\u0443\u0434\u0435\u0442 \u0436\u0434\u0430\u0442\u044C \
    \u043F\u043E\u044F\u0432\u043B\u0435\u043D\u0438\u044F \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u043A\u0435\u0448\u0435.
expirationTime#description \u0418\u043D\u0442\u0435\u0440\u0432\u0430\u043B \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u0432 \u043C\u0438\u043B\u0438\u0441\u0435\u043A\u0443\u043D\u0434\u0430\u0445 \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u043A\u0435\u0448\u0435 \u0443\u0441\u0442\u0430\u0440\u0435\u0432\u0430\u044E\u0442

activeConsumer \u0417\u0430\u0434\u0430\u0435\u0442 \u0442\u0438\u043F \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F. \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>TRUE</b> \u0442\u043E\u0433\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C \u0438\u043C\u0435\u0435\u0442 \
    \u043F\u0440\u0430\u0432\u043E \u043E\u0431\u043D\u043E\u0432\u0438\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u043A\u0435\u0448\u0435 (\u0435\u0441\u043B\u0438 \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u043A\u0435\u0448\u0435 \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044E\u0442 \u0438\u043B\u0438 \u0443\u0441\u0442\u0430\u0440\u0435\u043B\u0438). \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435  \
    <b>FALSE</b> \u0442\u043E\u0433\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u043A\u0435\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435.