#  Copyright 2011 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class (Pipe) \u041f\u0440\u043e\u0432\u043e\u0434\u0438\u0442 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 \u0437\u0430\u043f\u0438\u0441\u0438, \u043f\u043e\u0441\u0442\u0443\u043f\u0438\u0432\u0448\u0435\u0439 \u043d\u0430 \u0432\u0445\u043e\u0434.
@class#description (Pipe) \u041f\u0440\u043e\u0432\u043e\u0434\u0438\u0442 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 \u0437\u0430\u043f\u0438\u0441\u0438, \u043f\u043e\u0441\u0442\u0443\u043f\u0438\u0432\u0448\u0435\u0439 \u043d\u0430 \u0432\u0445\u043e\u0434. \u0420\u0430\u0431\u043e\u0442\u0430\u0435\u0442 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
    <ul> \
    <li>\u0415\u0441\u043b\u0438 \u043d\u0430 \u0432\u0445\u043e\u0434 \u043f\u043e\u0441\u0442\u0443\u043f\u0430\u044e\u0442 \u0434\u0430\u043d\u043d\u044b\u0435 \u043e\u0442\u043b\u0438\u0447\u043d\u044b\u0435 \u043e\u0442 \u0437\u0430\u043f\u0438\u0441\u0438, \u0442\u043e \u043e\u043d\u0438 \u043f\u0440\u043e\u0441\u0442\u043e \u043f\u0440\u043e\u0431\u0440\u0430\u0441\u044b\u0432\u0430\u044e\u0442\u0441\u044f \u043d\u0430 \u0432\u044b\u0445\u043e\u0434</li> \
    <li>\u0415\u0441\u043b\u0438 \u0437\u0430\u043f\u0438\u0441\u044c \u043f\u0440\u043e\u0448\u043b\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 - \u043e\u043d\u0430 \u043f\u0440\u043e\u0431\u0440\u0430\u0441\u044b\u0432\u0430\u0435\u0442\u0441\u044f \u043d\u0430 \u0432\u044b\u0445\u043e\u0434</li> \
    <li>\u0415\u0441\u043b\u0438 \u0437\u0430\u043f\u0438\u0441\u044c \u043d\u0435 \u043f\u0440\u043e\u0448\u043b\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443: \
        <ul>\
        <li><b>useOnRecordValidationError</b>=FALSE \u0438\u043b\u0438  \
            <b>useOnRecordValidationError</b>=TRUE \u0438 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 <b>onRecordValidationError</b> \u0432\u0435\u0440\u043d\u0443\u043b\u043e \
            <b>null</b>, \u0442\u043e\u0433\u0434\u0430 \u043d\u0430 \u0432\u044b\u0445\u043e\u0434 \u043d\u0438\u0447\u0435\u0433\u043e \u043d\u0435 \u043f\u043e\u0434\u0430\u0435\u0442\u0441\u044f</li> \
        <li><b>useOnRecordValidationError</b>=TRUE \u0438 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 <b>onRecordValidationError</b> \u0432\u0435\u0440\u043d\u0443\u043b\u043e \
            <b>\u043d\u0435 null</b>, \u0442\u043e\u0433\u0434\u0430 \u043d\u0430 \u0432\u044b\u0445\u043e\u0434 \u043f\u043e\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 <b>onRecordValidationError</b></li> \
        </ul> \
    </ul> 

onRecordValidationError#description \u0415\u0441\u043b\u0438 \u0437\u0430\u043f\u0438\u0441\u044c \u043d\u0435 \u043f\u0440\u043e\u0449\u043b\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 \u0438 <b>useOnRecordValidationError</b>=TRUE \
    \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c\u0441\u044f \u0434\u0430\u043d\u043d\u043e\u0435 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435. \u0415\u0441\u043b\u0438 \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u0432\u0435\u0440\u043d\u0435\u0442 <b>null</b> \u0442\u043e\u0433\u0434\u0430 \u043d\u0430 \u0432\u044b\u0445\u043e\u0434 \u043d\u0438 \u0447\u0435\u0433\u043e \u043d\u0435 \u043f\u0440\u043e\u0431\u0440\u043e\u0441\u0438\u0442\u044c\u0441\u044f \
    \u0438\u043d\u0430\u0447\u0435 \u043d\u0430 \u0432\u044b\u0445\u043e\u0434 \u043f\u0440\u043e\u0431\u0440\u043e\u0441\u0438\u0442\u044c\u0441\u044f \u0440\u0435\u0437\u0443\u043b\u044c\u0442\u0430\u0442 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u044f. \
    <p> \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u043e\u043a\u0440\u0443\u0436\u0435\u043d\u0438\u044f: \
    <ul>\
    <li>context (org.raven.ds.DataContext) - \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u043f\u0435\u0440\u0435\u0434\u0430\u0447\u0438 \u0434\u0430\u043d\u043d\u044b\u0445</li>\
    <li>dataSource (org.raven.ds.DataSource) - \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u043e\u0442 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043f\u0440\u0438\u0448\u043b\u0438 \u0434\u0430\u043d\u043d\u044b\u0435</li>\
    <li>record (org.raven.ds.Record) - \u0437\u0430\u043f\u0438\u0441\u044c, \u043d\u0435 \u043f\u0440\u043e\u0448\u0435\u0434\u0448\u0430\u044f \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443</li>\
    <li>record (org.raven.ds.RecordValidationErrors) - \u043e\u0448\u0438\u0431\u043a\u0438 \u0432\u043e\u0437\u043d\u0438\u043a\u0448\u0438\u0435 \u043f\u0440\u0438 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0435 \u0437\u0430\u043f\u0438\u0441\u0438</li>\
    </ul>
useOnRecordValidationError#description \u0415\u0441\u043b\u0438 <b>true</b> \u0442\u043e\u0433\u0434\u0430 \u0432 \u0441\u043b\u0443\u0447\u0430\u0435 \u043a\u043e\u0433\u0434\u0430 \u0437\u0430\u043f\u0438\u0441\u044c \u043d\u0435 \u043f\u0440\u043e\u0448\u043b\u0430 \u043f\u0440\u043e\u0432\u0435\u0440\u043a\u0443 \
    \u0432\u044b\u043f\u043e\u043b\u043d\u0438\u0442\u044c\u0441\u044f \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 <b>onRecordValidationError</b>
