#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u044B\u0445 \u043E\u0442 LDAP \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0435\u0435 \u0441\u0432\u043E\u0438\u043C \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C
@class#description \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u044B\u0445 \u043E\u0442 LDAP \u0441\u0435\u0440\u0432\u0435\u0440\u0430 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0435\u0435 \u0441\u0432\u043E\u0438\u043C \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C

url#description \u0410\u0434\u0440\u0435\u0441 LDAP \u0441\u0435\u0440\u0432\u0435\u0440\u0430 (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440 - ldap://some.server.com)
baseDN#description DN \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0431\u0443\u0434\u0435\u0442 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u0435\u0442 \u043F\u043E\u0438\u0441\u043A. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0432 \u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u043A\u043E\u0433\u0434\u0430 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \
    \u0441\u0435\u0441\u0441\u0438\u043E\u043D\u043D\u043E\u0433\u043E \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <i>startFetchFromDN</i>
userDN#description DN \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043F\u043E\u0434 \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u0431\u0443\u0434\u0435\u0442 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u0435\u043D\u043E \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043A LDAP \u0441\u0435\u0440\u0432\u0435\u0440\u0443
userPassword#description \u041F\u0430\u0440\u043E\u043B\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F
authType#description \u0422\u0438\u043F \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u0438 (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440: simple, digest-md5)

filter \u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0444\u0438\u043B\u044C\u0442\u0440\u0430 \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u043A LDAP \u0441\u0435\u0440\u0432\u0435\u0440\u0443. \
    <p/>\u0421\u043F\u0438\u0441\u043E\u043A \u0440\u0435\u0441\u0443\u0440\u0441\u043E\u0432 \u0441 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435\u043C \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432\
    <ul>\
    <li><a href="http://confluence.atlassian.com/display/DEV/How+to+write+a+LDAP+search+filter>How to write a LDAP search filter</a></li>\
    <li><a href="http://www.opennet.ru/base/net/ldap_search_filter.txt.html">\u0424\u0438\u043B\u044C\u0442\u0440\u044B \u0434\u043B\u044F \u043F\u043E\u0438\u0441\u043A\u0430 \u0432 LDAP (ldap auth search filter)</a></li>\
    </ul>
attributes \u0421\u043F\u0438\u0441\u043E\u043A \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u043E\u0439 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C. \u0415\u0441\u043B\u0438 \u0441\u043F\u0438\u0441\u043E\u043A \u043D\u0435 \u0437\u0430\u0434\u0430\u043D \u0442\u043E\u0433\u0434\u0430 \
    \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0432\u0441\u0435\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u043F\u043E\u043F\u0430\u0434\u0435\u0442 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442.\
    <p/>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u044D\u0442\u043E\u0433\u043E \u043F\u043E\u043B\u044F \u0438\u043C\u0435\u0435\u0442 \u0441\u043C\u044B\u0441\u043B \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u043E\u0433\u0434\u0430 \u043A\u043E\u0433\u0434\u0430 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <i>fetchAttributes</i> \
    \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>true</b>
fetchAttributes \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>true</b> \u0442\u043E\u0433\u0434\u0430 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u043F\u043E\u043F\u0430\u0434\u0443\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u0437\u0430\u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \
    \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <i>attributes</i>
startFetchFromDN DN \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0431\u0443\u0434\u0443\u0442 \u043D\u0430\u0447\u0430\u0442 \u043F\u043E\u0438\u0441\u043A. \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u043D\u0430\u0447\u0430\u043B\u044C\u043D\u043E\u0433\u043E DN \
    \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D \u0431\u0430\u0437\u043E\u0432\u044B\u0439 DN, \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u0439 \u0432 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0435 \u0434\u0430\u043D\u043D\u044B\u0445
addObjectDNToResult \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>true</b> \u0442\u043E\u0433\u0434\u0430 \u0432 \u043F\u0435\u0440\u0432\u043E\u0439 \u043A\u043E\u043B\u043E\u043D\u043A\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0431\u0443\u0434\u0443\u0442 \u0445\u0440\u0430\u043D\u0438\u0442\u044C\u0441\u044F DN \
    \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u043D\u0430\u0439\u0434\u0435\u043D\u043D\u043E\u0433\u043E \u043E\u0431\u044A\u0435\u043A\u0442\u0430