#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class#description \u0424\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442 \u043e\u0442\u0432\u0435\u0442\u044b \u043d\u0430 \u0441\u0435\u0442\u0435\u0432\u044b\u0435 \u0437\u0430\u043f\u0440\u043e\u0441\u044b. \
    <p/>\u0421\u0435\u0442\u0435\u0432\u043e\u0439 \u0437\u0430\u043f\u0440\u043e\u0441 \u0441\u043e\u0441\u0442\u043e\u0438\u0442 \u0438\u0437 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0438 \u0435\u0433\u043e \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u0432. \u041a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u044b \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0442\u0441\u044f \u043f\u0443\u0442\u0435\u043c \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0443\u0437\u043b\u043e\u0432 \
    \u0432\u043d\u0443\u0442\u0440\u0438 \u0434\u0430\u043d\u043d\u043e\u0433\u043e. \u0418\u043c\u044f \u0443\u0437\u043b\u0430 \u0438 \u0435\u0441\u0442\u044c \u043d\u0430\u0437\u0432\u0430\u043d\u0438\u0435 \u043a\u043e\u043d\u0435\u043a\u0441\u0442\u0430. \u041a\u0430\u0436\u0434\u044b\u0439 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u0432 \u043f\u0440\u0430\u0432\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0438\u0442\u044c:\
    <ul>\
    <li>\u0441\u043f\u0438\u0441\u043e\u043a \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u0445 \u0438 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u0445 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u043e\u0432</li> \
    <li>\u0441\u043f\u0438\u0441\u043e\u043a ip \u0430\u0434\u0440\u0435\u0441\u043e\u0432 \u0441 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0434\u043e\u0437\u0432\u043e\u043b\u0435\u043d\u043e \u043e\u0431\u0440\u0430\u0449\u0430\u0442\u044c\u0441\u044f \u043a \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443</li> \
    </ul>\
    <p/>\
    \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0435\u0441\u043b\u0438 \u0432\u043d\u0443\u0442\u0440\u0438 \u0434\u0430\u043d\u043d\u043e\u0433\u043e \u0443\u0437\u043b\u0430 \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442 \u0442\u0438\u043f\u0430 (NetworkResponseContextNode) \u0441 \u0438\u043c\u0435\u043d\u0435\u043c <i>test</i> \
    \u0438 \u0441\u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0435\u0433\u043e \u0440\u0430\u0431\u043e\u0442\u0443 \u0441 \u043e\u0434\u043d\u0438\u043c \u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u044b\u043c \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u043c <i>p1</i> \u0442\u043e\u0433\u0434\u0430 \u043a \u0434\u0430\u043d\u043d\u043e\u043c\u0443 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0443 \
    \u043c\u043e\u0436\u043d\u043e \u043e\u0431\u0440\u0430\u0442\u0438\u0442\u044c\u0441\u044f \u043f\u043e http \u043f\u0440\u043e\u0442\u043e\u043a\u043e\u043b\u0443 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u043c \u043e\u0431\u0440\u0430\u0437\u043e\u043c: \
    <br/><i>http://raven.server.address:port/raven/sri/<b>test</b>?<b>p1=p1_value</b></i> \
    <p>\u041a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u044b \u043c\u043e\u0433\u0443\u0442 \u0438\u043c\u0435\u0442\u044c \u0432\u043b\u043e\u0436\u0435\u043d\u043d\u0443\u044e \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0443. \u0412\u043b\u043e\u0436\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u043f\u0440\u0438 \u043f\u043e\u043c\u043e\u0449\u0438 \u0443\u0437\u043b\u043e\u0432 \u0442\u0438\u043f\u0430 <b>NetworkResponseGroupNode</b> \
    \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0437\u0430\u043f\u0440\u043e\u0441 <i>http://raven.server.address:port/raven/sri/<b>group_name</b>/response_name</i> \
    \u043c\u043e\u0436\u043d\u043e \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u0442\u044c \u043f\u0440\u0438 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u0439 \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0435 \u0443\u0437\u043b\u043e\u0432: \
    <pre>\n\
    NetworkServiceNode\n\
    &nbsp;&nbsp;|\n\
    &nbsp;&nbsp;|-NetworkResponseGroupNode(name=<b>group_name</b>)\n\
    &nbsp;&nbsp;&nbsp;&nbsp;|\n\
    &nbsp;&nbsp;&nbsp;&nbsp;|-NetworkResponseContextNode(name=response_name)\n\
    </pre>\
    <p>\u0412 \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0438 \u043f\u0443\u0442\u0438 \u0434\u043e \u0443\u0437\u043b\u0430 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0449\u0435\u0433\u043e \u043e\u0442\u0432\u0435\u0442 \u043c\u043e\u0433\u0443\u0442 \u0443\u0447\u0430\u0441\u0442\u0432\u043e\u0432\u0430\u0442\u044c \u0443\u0437\u043b\u044b \u0442\u0438\u043f\u0430 <b>IfNode</b>. \u0418\u043c\u044f \u0442\u0430\u043a\u043e\u0433\u043e \
    \u0443\u0437\u043b\u0430 \u043d\u0435 \u0443\u0447\u0430\u0441\u0442\u0432\u0443\u0435\u0442 \u0432 \u043f\u0443\u0442\u0438 \u0434\u043e \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0430\u044f <b>IfNode</b> \u043c\u043e\u0436\u043d\u043e, \u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0434\u043b\u044f \u043e\u0434\u043d\u043e\u0433\u043e \u0438 \u0442\u043e\u043a\u043e\u0433\u043e \u0436\u0435 \
    \u043f\u0443\u0442\u0438 \u0440\u0435\u0430\u043b\u0438\u0437\u043e\u0432\u0430\u0442\u044c \u0440\u0430\u0437\u043b\u0438\u0447\u043d\u043e\u0435 \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u0435 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u0432 \u0437\u0430\u0432\u0438\u0441\u0438\u043c\u043e\u0441\u0442\u0438 \u043e\u0442 IP \u0430\u0434\u0440\u0435\u0441\u0430 \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0431\u044b\u043b \u0441\u0434\u0435\u043b\u0430\u043d \u0437\u0430\u043f\u0440\u043e\u0441. \
    \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u043f\u0440\u0438 \u0442\u0430\u043a\u043e\u0439 \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0435 \u0443\u0437\u043b\u043e\u0432\
    <pre>\n\
    NetworkServiceNode\n\
    &nbsp;&nbsp;|\n\
    &nbsp;&nbsp;|-IfNode(name=if1, expression=<b>requesterIp=='10.1.1.1'</b>)\n\
    &nbsp;&nbsp;|&nbsp;&nbsp;|\n\
    &nbsp;&nbsp;|&nbsp;&nbsp;|-NetworkResponseContextNode(name=test)\n\
    &nbsp;&nbsp;|-IfNode(name=if2, expression=<b>requesterIp=='10.1.1.2'</b>)\n\
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|\n\
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|-NetworkResponseContextNode(name=test)\n\
    </pre>\
    \u0422\u043e\u0433\u0434\u0430:\
    <ul>\
    <li>\u0434\u043b\u044f \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0441 \u0430\u0434\u0440\u0435\u0441\u0430 10.1.1.1 <i>http://raven.server.address:port/raven/sri/test</i> \u043e\u0442\u0432\u0435\u0442 \u0431\u0443\u0434\u0435\u0442 \
        \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0443\u0437\u0435\u043b NetworkServiceNode/<b>if1</b>/test\
    <li>\u0434\u043b\u044f \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0441 \u0430\u0434\u0440\u0435\u0441\u0430 10.1.1.2 <i>http://raven.server.address:port/raven/sri/test</i> \u043e\u0442\u0432\u0435\u0442 \u0431\u0443\u0434\u0435\u0442 \
        \u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0443\u0437\u0435\u043b NetworkServiceNode/<b>if2</b>/test\
    <li>\u0430 \u0434\u043b\u044f \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0441 \u0430\u0434\u0440\u0435\u0441\u0430 10.1.1.3 <i>http://raven.server.address:port/raven/sri/test</i> \u043f\u043e\u043b\u0443\u0447\u0438\u043c \
        HTTP STATUS 404 (Not Found)\
    </ul>\
    \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f \u0434\u043b\u044f <b>IfNode#expression</b>:\
    <ul>\
    <li><b>requesterIp</b> (String) (<i>\u0434\u043e\u0441\u0442\u0443\u043f\u0435\u043d \u0432 \u0444\u0430\u0437\u0430\u0445 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u0438 \u0438 \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u0438 \u043e\u0442\u0432\u0435\u0442\u0430</i>) - IP \u0430\u0434\u0440\u0435\u0441, \u0441 \u043a\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u0437\u0430\u043f\u0440\u043e\u0448\u0435\u043d\u0430 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f\
    <li><b>requestContext</b> (String) (<i>\u0434\u043e\u0441\u0442\u0443\u043f\u0435\u043d \u0432 \u0444\u0430\u0437\u0430\u0445 \u0430\u0443\u0442\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u0438 \u0438 \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u0438 \u043e\u0442\u0432\u0435\u0442\u0430</i>) - \u043f\u0443\u0442\u044c \u0434\u043e \u0443\u0437\u043b\u0430 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0449\u0435\u0433\u043e \u043e\u0442\u0432\u0435\u0442\
    <li><b>requestParams</b> (HashMap<String, Object>) <i>\u0434\u043e\u0441\u0442\u0443\u043f\u0435\u043d \u0432 \u0444\u0430\u0437\u0435 \u043f\u043e\u043b\u0443\u0447\u0435\u043d\u0438\u044f \u043e\u0442\u0432\u0435\u0442\u0430</i> - \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0437\u0430\u043f\u0440\u043e\u0441\u0430\
    </ul>\
    <p>\u0415\u0441\u043b\u0438 \u0432 \u0443\u0437\u043b\u0435 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0449\u0438\u0439 \u043e\u0442\u0432\u0435\u0442 \u043d\u0430\u0439\u0434\u0435\u043d, \u0430 \u0447\u0430\u0441\u0442\u044c \u043f\u0443\u0442\u0438 \u043e\u0441\u0442\u0430\u043b\u0430\u0441\u044c \u043d\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0430\u043d\u043d\u043e\u0439, \u0442\u043e\u0433\u0434\u0430 \u044d\u0442\u0430 \u0447\u0430\u0441\u0442\u044c \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u0435\u0442\u0441\u044f  \u0432 \
       \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0441 \u0438\u043c\u0435\u043d\u0435\u043c <b>subcontext</b> \u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u0442\u0441\u044f \u043e\u0442\u0432\u0435\u0442. \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440 \u043f\u0443\u0441\u0442\u044c \u0443 \u043d\u0430\u0441 \u0431\u0443\u0434\u0435\u0442 \
       \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0430\u044f \u0441\u0442\u0440\u0443\u043a\u0442\u0443\u0440\u0430\
    <pre>\
    NetworkServiceNode\n\
    &nbsp;&nbsp;|\n\
    &nbsp;&nbsp;|-NetworkResponseContextNode(name=test)\n\
    </pre>\n\
    \u0422\u043e\u0433\u0434\u0430 \u043f\u0440\u0438 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0438 \u0437\u0430\u043f\u0440\u043e\u0441\u0430 <i>http://raven.server.address:port/raven/sri/test/test2/test3</i>. \u0412 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \
    \u0443\u0437\u043b\u0430 \u0444\u043e\u0440\u043c\u0438\u0440\u0443\u044e\u0449\u0435\u0433\u043e \u043e\u0442\u0432\u0435\u0442 \u0431\u0443\u0434\u0435\u0442 \u0432\u044b\u0431\u0440\u0430\u043d \u0443\u0437\u0435\u043b <b>test</b>, \u043d\u043e \u043f\u0435\u0440\u0435\u0434 \u0442\u0435\u043c \u043a\u0430\u043a \u0431\u0443\u0434\u0435\u0442 \u0441\u0444\u043e\u0440\u043c\u0438\u0440\u043e\u0432\u0430\u043d \u0437\u0430\u043f\u0440\u043e\u0441 \u043a \
    \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430\u043c \u0437\u0430\u043f\u0440\u043e\u0441\u0430 \u0431\u0443\u0434\u0435\u0442 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0430 \u043f\u0430\u0440\u0430 <b>subcontext</b> -> <b>test2/test3</b>
    


requestsCount#description \u041e\u0431\u0449\u0435\u0435 \u043a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u043d\u044b\u0445 \u0437\u0430\u043f\u0440\u043e\u0441\u043e\u0432
requestsWithErrors#description \u041a\u043e\u043b\u0438\u0447\u0435\u0441\u0442\u0432\u043e \u0437\u0430\u043f\u0440\u043e\u0441\u043e\u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043f\u043e \u0442\u043e\u0439 \u0438\u043b\u0438 \u0438\u043d\u043e\u0439 \u043f\u0440\u0438\u0447\u0438\u043d\u0435 \u043d\u0435 \u0431\u044b\u043b\u0438 \u0432\u044b\u043f\u043e\u043b\u043d\u0435\u043d\u044b