#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C (data consumer) \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0439 \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u0438 subversion
@class#description \u041F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C (data consumer) \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0439 \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u0438 subversion. \
    <p/>\
    \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C\u044E \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0443\u0437\u043B\u0430 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435: \
    <ul>\
    <li>\u0414\u0430\u043D\u043D\u044B\u0435 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u0435\u043C\u044B\u0435 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043E\u043B\u0436\u043D\u044B \u0431\u044B\u0442\u044C \u0438\u043D\u043A\u0430\u043F\u0441\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u044B \u0432 <b>\u0437\u0430\u043F\u0438\u0441\u044C</b> (record)</li>\
    <li>\u0412 \u0437\u0430\u043F\u0438\u0441\u0438 \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u0438\u0441\u0443\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C \u043F\u043E\u043B\u044F: <b>path</b>, <b>data</b>. \
        <br>\u0422\u0438\u043F \u043F\u043E\u043B\u044F <i>path</i> - <i>STRING</i>\
        <br>\u0422\u0438\u043F\u043E\u043C \u043F\u043E\u043B\u044F <i>data</i> \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C: <i>STRING</i>, <i>OBJECT (\u043C\u0430\u0441\u0441\u0438\u0432 \u0431\u0430\u0439\u0442\u043E\u0432, byte[])</i>, \
            <i>OBJECT (\u043F\u043E\u0442\u043E\u043A \u0431\u0430\u0439\u0442\u043E\u0432, java.io.InputStream)</i>\
    </li> \
    </ul>\
    <p/>\
    \u041A\u043E\u043C\u043C\u0435\u043D\u0442\u0430\u0440\u0438\u0439 \u043A \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044E \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 <i>sourceEncoding</i>, <i>targetEncoding</i>.\
    <ul>\
    <li>\
        \u0415\u0441\u043B\u0438 \u043D\u0438 sourceEncoding \u043D\u0435 targetEncoding \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u044B \u0438 \u0442\u0438\u043F \u043F\u043E\u043B\u044F <i>data</i> \u043D\u0435 STRING \
        \u0442\u043E\u0433\u0434\u0430 \u0434\u0430\u043D\u043D\u044B\u0435 \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u044E\u0442\u0441\u044F \u0432 \u0444\u0430\u0439\u043B \u0432 \u0442\u043E\u043C \u0432\u0438\u0434\u0435 \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u043E\u043D\u0438 \u043F\u0440\u0438\u0448\u043B\u0438 \
    </li>\
    <li>\
        \u0412\u043E \u0432\u0441\u0435\u0445 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0445 \u0441\u043B\u0443\u0447\u0430\u044F\u0445 \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u0431\u0443\u0434\u0435\u0442 \u0443\u043A\u0430\u0437\u0430\u043D\u0430 \u044F\u0432\u043D\u043E \u0438\u043B\u0438 \u043D\u0435 \u044F\u0432\u043D\u043E. \u0422.\u0435. \u0435\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
        <i>sourceEncoding</i> \u0438\u043B\u0438 <i>targetEncoding</i> \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0430 \u043A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \
        \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E.\
    </li>\
    <ul>

repositoryUrl#description URL \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u044F subversion. \u0415\u0441\u043B\u0438 URL \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u043D\u0430 \u043B\u043E\u043A\u0430\u043B\u044C\u043D\u044B\u0439 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u0439 \u0438 \
    \u043F\u043E \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u043C\u0443 \u043F\u0443\u0442\u0438 \u0435\u0433\u043E \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u0442\u043E\u0433\u0434\u0430 \u043E\u043D \u0431\u0443\u0434\u0435\u0442 \u0441\u043E\u0437\u0434\u0430\u043D \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u043F\u0440\u0438 \u043F\u0435\u0440\u0432\u043E\u043C \
    \u043F\u043E\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u0438 \u0434\u0430\u043D\u043D\u044B\u0445.
workDirectory#description \u0420\u0430\u0431\u043E\u0447\u0438\u0439 \u043A\u0430\u0442\u0430\u043B\u043E\u0433. \u041A\u0430\u0442\u0430\u043B\u043E\u0433 \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u0431\u0443\u0434\u0443\u0442 \u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0444\u0430\u0439\u043B\u044B \u043F\u0435\u0440\u0435\u0434 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u0435\u043C \
    \u0432 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u0439 subversion. \u0415\u0441\u043B\u0438 \u043A\u0430\u0442\u0430\u043B\u043E\u0433 \u043D\u0435 \u0441\u043E\u0437\u0434\u0430\u043D \u0442\u043E\u0433\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u043F\u044B\u0442\u043A\u0430 \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0435\u0433\u043E \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u043F\u0440\u0438 \
    \u043F\u0435\u0440\u0432\u043E\u043C \u043F\u043E\u0441\u0442\u0443\u043F\u043B\u0435\u043D\u0438\u0438 \u0434\u0430\u043D\u043D\u044B\u0445.
username#description \u0418\u043C\u044F \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043F\u043E\u0434 \u043A\u043E\u0442\u043E\u0440\u044B\u043C \u0431\u0443\u0434\u0435\u0442 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u0435\u043D\u043E \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0435 \u043A \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u0430\u0440\u0438\u044E subversion.
password#description \u041F\u0430\u0440\u043E\u043B\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F.
sourceEncoding#description \u041A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0445 \u0434\u0430\u043D\u043D\u044B\u0445.
targetEncoding#description \u041A\u043E\u0434\u0438\u0440\u043E\u0432\u043A\u0430 \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0434\u0430\u043D\u043D\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \u0437\u0430\u043F\u0438\u0441\u0430\u043D\u044B \u0432 \u0440\u0430\u0431\u043E\u0447\u0438\u0439 \u043A\u0430\u0442\u0430\u043B\u043E\u0433.