#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u043E\u043B\u0443\u0447\u0430\u044E\u0449\u0438\u0439 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u043F\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0443 syslog \u0438 \u043F\u0435\u0440\u0435\u0434\u0430\u044E\u0449\u0438\u0439 \u0438\u0445 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u0432 \u0432\u0438\u0434\u0435 \u0437\u0430\u043F\u0438\u0441\u0435\u0439.
@class#description \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0434\u0430\u043D\u043D\u044B\u0445, \u043F\u043E\u043B\u0443\u0447\u0430\u044E\u0449\u0438\u0439 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u043F\u043E \u043F\u0440\u043E\u0442\u043E\u043A\u043E\u043B\u0443 syslog \u0438 \u043F\u0435\u0440\u0435\u0434\u0430\u044E\u0449\u0438\u0439 \u0438\u0445 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u0432 \u0432\u0438\u0434\u0435 \u0437\u0430\u043F\u0438\u0441\u0435\u0439. \
    <p>\u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C\u044E \u0443\u0437\u043B\u0430 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435:\
    <ul>\
    <li>\u0421\u043E\u0437\u0434\u0430\u0442\u044C \u0441\u0445\u0435\u043C\u0443 \u0437\u0430\u043F\u0438\u0441\u0438, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0442\u0438\u043F \u0443\u0437\u043B\u0430 <b>SyslogRecordSchemaNode</b></li>\
    <li>\u0421\u043E\u0441\u043B\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u0432\u043D\u043E\u0432\u044C \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u0443\u044E \u0441\u0445\u0435\u043C\u0443 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442 <b>schema</b></li>\
    <li>\u041D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 <b>protocol</b> \u0438 <b>port</b></li>\
    <li>\u0421\u0442\u0430\u0440\u0442\u043E\u0432\u0430\u0442\u044C \u0443\u0437\u0435\u043B</li>\
    <li>\u041D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u0435\u0439</li>\
    </ul>

protocol#description \u041F\u0440\u043E\u0442\u043E\u043A\u043E\u043B \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u0431\u0443\u0434\u0443\u0442 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442\u044C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F syslog
port#description \u041F\u043E\u0440\u0442 \u043D\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0443\u0442 \u043F\u0440\u0438\u0445\u043E\u0434\u0438\u0442\u044C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F syslog
schema#description \u0421\u0445\u0435\u043C\u0430 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0431\u0443\u0434\u0443\u0442 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C\u0441\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \u0438\u043D\u043A\u0430\u043F\u0441\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \
    syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F