#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435.
@class#description \u041E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u0435\u0441\u043B\u0438 \u043E\u043D\u043E \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u0435\u0442 \u0443\u0441\u043B\u043E\u0432\u0438\u044E \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u043C\u0443 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 \
    <b>acceptMessageExpression</b>. \u0415\u0441\u043B\u0438 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u0435\u0442 \u0443\u0441\u043B\u043E\u0432\u0438\u044E, \u0442\u043E\u0433\u0434\u0430 \u043D\u0430 syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \
    \u0438\u043D\u043A\u0430\u043F\u0441\u0443\u043B\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0432 \u0437\u0430\u043F\u0438\u0441\u044C, \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u0443\u044E \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0441\u0445\u0435\u043C\u044B \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u0439 \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>recordSchema</b> \u0438 \
    \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C. \
    <p>\
    \u0421\u0445\u0435\u043C\u0430 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u0441\u043E\u0437\u0434\u0430\u043D\u0430 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0442\u0438\u043F\u0430 \u0443\u0437\u043B\u0430 <b>SyslogRecordSchemaNode</b>
recordSchema#description \u0421\u0445\u0435\u043C\u0430 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0431\u0443\u0434\u0443\u0442 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C\u0441\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \u0438\u043D\u043A\u0430\u043F\u0441\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \
    syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F
acceptMessageExpression#description \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0432\u0435\u0440\u043D\u0435\u0442 <b>true</b> \u0442\u043E\u0433\u0434\u0430 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0435 \
    syslog \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u0438\u043D\u043A\u0430\u043F\u0441\u0443\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u043E \u0432 \u0437\u0430\u043F\u0438\u0441\u044C \u0438 \u043E\u0442\u043E\u0441\u043B\u0430\u043D\u043E \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C
messagesStat#description \u0421\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0430 \u043F\u043E \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043D\u044B\u043C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F\u043C