#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0421\u043E\u0445\u0440\u0430\u043D\u044F\u0435\u0442 \u0437\u0430\u043F\u0438\u0441\u0438 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0435 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0411\u0414
@class#descrition \u0421\u043E\u0445\u0440\u0430\u043D\u044F\u0435\u0442 \u0437\u0430\u043F\u0438\u0441\u0438 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0435 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0411\u0414. \
    \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u0437\u0430\u043F\u0438\u0441\u0438 \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u043B\u0438\u0441\u044C \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0411\u0414 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435: \
    <ol> \
    <li>\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0441\u0445\u0435\u043C\u0443 \u0437\u0430\u043F\u0438\u0441\u0438 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 DatabaseRecordExtension</li> \
    <li>\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0441\u0445\u0435\u043C\u0443 \u043F\u043E\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 DatabaseRecordFieldExtension. \u0412 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0411\u0414 \u0431\u0443\u0434\u0443\u0442 \
        \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0442\u0435\u0445 \u043F\u043E\u043B\u0435\u0439 \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0441\u0445\u0435\u043C\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0430 </li> \
        DatabaseRecordFieldExtension \
    </ol>
recordSchema#description \u0421\u0445\u0435\u043C\u0430 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445
databaseExtensionName#description \u0418\u043C\u044F \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0439 \u0441\u0445\u0435\u043C\u044B (DatabaseRecordExtension) \u0438 \u043F\u043E\u043B\u044F \u0441\u0445\u0435\u043C\u044B \
    (DatabaseRecordFieldExtension). \u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0437\u0430\u0434\u0430\u0432\u0430\u0442\u044C \u0435\u0441\u043B\u0438 \u0432 \u0441\u0445\u0435\u043C\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0439 \
    \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u0445 \u0442\u0438\u043F\u043E\u0432.
connectionPool#description \u041F\u0443\u043B \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0439 \u0411\u0414
recordBufferSize#description \u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0447\u0435\u0440\u0435\u0437 \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0444\u0438\u043A\u0441\u0430\u0446\u0438\u044F \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0439 \u0432 \u0411\u0414.
recordsRecieved#description \u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u044B\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445
recordsSaved#description \u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u043D\u044B\u0445 \u0432 \u0431\u0430\u0437\u0443 \u0434\u0430\u043D\u043D\u044B\u0445
recordSetsRecieved#description \u041A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u044B\u0445 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u0437\u0430\u043F\u0438\u0441\u0435\u0439