#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0437\u0430\u043F\u0438\u0441\u0438 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F SQL \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u043A \u0411\u0414 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0438\u0445 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C
@class#description \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0437\u0430\u043F\u0438\u0441\u0438 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F SQL \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u043A \u0411\u0414 \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0438\u0445 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C.  \
    \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u0443\u044E \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435: \
    <ol> \
    <li>\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0441\u0445\u0435\u043C\u0443 \u0437\u0430\u043F\u0438\u0441\u0438 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 DatabaseRecordExtension</li> \
    <li>\u0414\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0432 \u0441\u0445\u0435\u043C\u0443 \u043F\u043E\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 DatabaseRecordFieldExtension. \u0412 \u0437\u0430\u043F\u0438\u0441\u044C \u0431\u0443\u0434\u0443\u0442 \u043F\u043E\u043C\u0435\u0449\u0430\u0442\u044C\u0441\u044F \
        \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0442\u0435\u0445 \u043F\u043E\u043B\u0435\u0439 \u0441\u0445\u0435\u043C\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0430 DatabaseRecordFieldExtension. \
    <li>\u0421\u0445\u0435\u043C\u044B \u043F\u043E\u043B\u0435\u0439 \u0443\u0447\u0430\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0445 \u0432 \u0444\u0438\u043B\u044C\u0442\u0440\u0430\u0446\u0438\u0438 \u0441\u0442\u0440\u043E\u043A \u043D\u0430 \u0443\u0440\u043E\u0432\u043D\u0435 \u043E\u043F\u0435\u0440\u0430\u0442\u043E\u0440\u0430 WHERE sql \
        \u0437\u0430\u043F\u0440\u043E\u0441\u0430 \u0434\u043E\u043B\u0436\u0435\u043D\u044B \u0431\u044B\u0442\u044C \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u044B FilterableRecordFieldExtension \
    </ol>

recordSchema#description \u0421\u0445\u0435\u043C\u0430 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0431\u0443\u0434\u0443\u0442 \u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0437\u0430\u043F\u0438\u0441\u0438.
connectionPool#description \u041F\u0443\u043B \u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u0439 \u0411\u0414
provideFilterAttributesToConsumers#description \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>TRUE</b> \u0442\u043E\u0433\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044C \
     \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u043E\u043C \u0434\u0430\u043D\u043D\u044B\u0445 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0434\u0430\u043D\u043D\u044B\u0439 \u0443\u0437\u0435\u043B \u043F\u043E\u043B\u0443\u0447\u0438\u0442 \u043D\u0430\u0431\u043E\u0440 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \
     \u0437\u0430\u0434\u0430\u044E\u0442 \u0444\u0438\u043B\u044C\u0442\u0440