#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u043D\u0430\u0431\u043E\u0440 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0438 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442 \u0438\u0445 \u0432\u0432\u0438\u0434\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
@class#description \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u043D\u0430\u0431\u043E\u0440 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0438 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442 \u0438\u0445 \u0432\u0432\u0438\u0434\u0435 \u0442\u0430\u0431\u043B\u0438\u0446\u044B

dataSource#description \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0434\u0430\u043D\u043D\u044B\u0445. \u0418\u0441\u0442\u043E\u0447\u043D\u0438\u043A \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0434\u0430\u043D\u043D\u043E\u043C\u0443 \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044E \
    \u043D\u0430\u0431\u043E\u0440 \u0437\u0430\u043F\u0438\u0441\u0435\u0439
recordSchema#description \u0421\u0445\u0435\u043C\u0430 \u0437\u0430\u043F\u0438\u0441\u0438 \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0431\u0443\u0434\u0435\u0442 \u0441\u0442\u0440\u043E\u0438\u0442\u044C\u0441\u044F \u0442\u0430\u0431\u043B\u0438\u0446\u0430
fieldsOrder#description \u0417\u0430\u0434\u0430\u0435\u0442 \u0441\u043F\u0438\u0441\u043E\u043A \u0438 \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043F\u043E\u043B\u0435\u0439 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0435. \u0424\u043E\u0440\u043C\u0430\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F - \
    \u0438\u043C\u0435\u043D\u0430 \u043F\u043E\u043B\u0435\u0439 \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u044B\u043C\u0438.
showFieldsInDetailColumn#description \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>TRUE</b> \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u043E\u043B\u043E\u043D\u043A\u0435 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0439 \u0432 \
    \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <b>detailColumnNumber</b> \u0431\u0443\u0434\u0435\u0442 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0430 \u0441\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0434\u0435\u0442\u0430\u043B\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \
    (\u0441\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u0445\u0440\u0430\u043D\u044F\u0449\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F\u0445 \u0432\u0441\u0435\u0445 \u043F\u043E\u043B\u0435\u0439 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0441\u043E\u043E\u0442\u0432\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \
    \u0441\u0442\u0440\u043E\u043A\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u044B)
detailColumnNumber#description \u0417\u0430\u0434\u0430\u0435\u0442 \u043D\u043E\u043C\u0435\u0440 \u043A\u043E\u043B\u043E\u043D\u043A\u0438 (\u043D\u0443\u043C\u0435\u0440\u0430\u0446\u0438\u044F \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0441\u044F \u0441 1) \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0431\u0443\u0434\u0435\u0442 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0430 \
    \u0441\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0434\u0435\u0442\u0430\u043B\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E (\u0441\u043C. \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044E \u043A \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0443 <b>showFieldsInDetailColumn</b>). \
    \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u0434\u043B\u044F \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0441\u0441\u044B\u043B\u043A\u0438 \u043D\u0430 \u0434\u0435\u0442\u0430\u043B\u0438\u0437\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u0431\u0443\u0434\u0435\u0442 \u0434\u043E\u0431\u0430\u0432\u043B\u0435\u043D\u0430 \
    \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043B\u043E\u043D\u043A\u0430 \u0432 \u043A\u043E\u043D\u0435\u0446 \u0442\u0430\u0431\u043B\u0438\u0446\u044B
autoRefresh#description \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <b>TRUE</b>, \u0442\u043E\u0433\u0434\u0430 \u043F\u0440\u0438 \u043F\u0435\u0440\u0432\u043E\u043C \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0438 \u043A \u0432\u043A\u043B\u0430\u0434\u043A\u0435 \
    "\u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440" \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u043C\u043E\u0435 \u0432\u043A\u043B\u0430\u0434\u043A\u0438 \u0431\u0443\u0434\u0435\u0442 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u043E.

detailColumnName \u0414\u0435\u0442\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F
detailValueViewLinkName \u041F\u0440\u043E\u0441\u043C\u043E\u0442\u0440
fieldNameColumnName \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u043E\u043B\u044F
fieldValueColumnName \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435

deleteMessage \u0423\u0434\u0430\u043B\u0438\u0442\u044C
deleteConfirmationMessage \u0423\u0434\u0430\u043B\u0438\u0442\u044C \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u0443\u044E \u0437\u0430\u043F\u0438\u0441\u044C
deleteCompletionMessage \u0417\u0430\u043F\u0438\u0441\u044C \u0443\u0441\u043F\u0435\u0448\u043D\u043E \u0443\u0434\u0430\u043B\u0435\u043D\u0430