#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u0435\u0440\u0435\u043A\u0440\u0435\u0441\u0442\u043D\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u0438\u0437 \u043D\u0430\u0431\u043E\u0440\u0430 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043F\u043E\u0441\u0442\u0443\u043F\u0438\u0432\u0448\u0438\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430.
@class#description \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u0435\u0440\u0435\u043A\u0440\u0435\u0441\u0442\u043D\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \u0438\u0437 \u043D\u0430\u0431\u043E\u0440\u0430 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043F\u043E\u0441\u0442\u0443\u043F\u0438\u0432\u0448\u0438\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430. \
    \u041F\u0440\u0438\u043C\u0435\u0440: \
    </p>\u0414\u043E\u043F\u0443\u0441\u0442\u0438\u043C \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u043F\u043E\u0441\u0442\u0443\u043F\u0438\u043B \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u043D\u0430\u0431\u043E\u0440 \u0437\u0430\u043F\u0438\u0441\u0435\u0439:\
    <pre>\
    |---------------|\
    |F1 | F2 | F3   | <-- \u043D\u0430\u0437\u0434\u0432\u0430\u043D\u0438\u0435 \u043F\u043E\u043B\u0435\u0439 \u0432 \u0437\u0430\u043F\u0438\u0441\u0438\
    |---------------|\
    |c1 | r1 | v1 1 |\
    |c1 | r2 | v1 2 |\
    |c2 | r1 | v2 1 |\
    |c2 | r2 | v2 2 |\
    ----------------\
    </pre>\
    <p/>\u0422\u043E\u0433\u0434\u0430 \u043D\u0430 \u0432\u044B\u0445\u043E\u0434\u0435 \u0431\u0443\u0434\u0435\u0442 \u0438\u043C\u0435\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0443\u044E \u0442\u0430\u0431\u043B\u0438\u0446\u0443 \
    <pre>\
    |-----------------|\
    |c0 | \u04411   | \u04412   |\
    |-----------------|\
    |r1 | v1 1 | v2 1 |\
    |r2 | v1 2 | v2 2 |\
    -------------------\
    </pre>\
    \u041F\u0440\u0438 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432: \
    <ul>\
    <li><b>masterFields - </b>F1</li>\
    <li><b>secondaryFields - </b>F2</li>\
    <li><b>cellValueFields - </b>F3</li>\
    <li><b>firstColumnName - </b>c0</li>\
    </ul>\
    <p/><span style="color: red"><b>\u0412\u0430\u0436\u043D\u043E. </b></span>\u041D\u0430\u0431\u043E\u0440 \u0437\u0430\u043F\u0438\u0441\u0435\u0439 \u043F\u043E\u0441\u0442\u0443\u043F\u0430\u044E\u0449\u0438\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \
    \u0431\u044B\u0442\u044C \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D \u043F\u043E <i>masterFields</i> \u043F\u043E\u043B\u044F\u043C.

masterFields#description \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u043E\u043B\u0435\u0439 \u0437\u0430\u043F\u0438\u0441\u0438, \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u044B\u043C\u0438, \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0442 \u043A\u043E\u043B\u043E\u043D\u043A\u0443 \
    \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442. \
    </p>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0441\u043B\u0443\u0434\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C: \
    <ul>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u043F\u043E\u043B\u044F</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u043E\u043B\u044F</li>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u043B\u0435\u0439</i> - \u0441\u0442\u0440\u043E\u043A\u0430 \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0438\u0437 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u044D\u0442\u0438\u0445 \u043F\u043E\u043B\u0435\u0439 \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u043E\u0439 \u0438 \u043F\u0440\u043E\u0431\u0435\u043B\u043E\u043C</li>\
    <li><i>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 useMasterFieldsExpression \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 TRUE</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 masterFieldsExpression</li>\
    </ul>
masterFieldsExpression#description \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0449\u0435\u0435 \u043A\u043E\u043B\u043E\u043D\u043A\u0443 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \
    \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 (\u0441\u043C. <i>masterFields</i>). \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F:\
    <ul>\
    <li><b>record</b> (org.raven.ds.Record) - \u0437\u0430\u043F\u0438\u0441\u044C \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u0430\u044F \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0432\u0440\u0435\u043C\u0435\u043D\u0438</li>\
    </ul>
useMasterFieldsExpression#description \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <i>true</i> \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0449\u0435\u0433\u043E \
    \u043A\u043E\u043B\u043E\u043D\u043A\u0443 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0431\u0443\u0434\u0435\u0442 \u0432\u0437\u044F\u0442\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <i>masterFieldsExpression</i>

secondaryFields#description \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u043E\u043B\u0435\u0439 \u0437\u0430\u043F\u0438\u0441\u0438, \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u044B\u043C\u0438, \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0442 \u0441\u0442\u0440\u043E\u043A\u0443 \
    \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442. \
    </p>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0441\u043B\u0443\u0434\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C: \
    <ul>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u043F\u043E\u043B\u044F</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u043E\u043B\u044F</li>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u043B\u0435\u0439</i> - \u0441\u0442\u0440\u043E\u043A\u0430 \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0438\u0437 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u044D\u0442\u0438\u0445 \u043F\u043E\u043B\u0435\u0439 \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u043E\u0439 \u0438 \u043F\u0440\u043E\u0431\u0435\u043B\u043E\u043C</li>\
    <li><i>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 useSecondaryFieldsExpression \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 TRUE</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 secondaryFieldsExpression</li>\
    </ul>
secondaryFieldsExpression#description \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0449\u0435\u0435 \u0441\u0442\u0440\u043E\u043A\u0443 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \
    \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 (\u0441\u043C. <i>secondaryFields</i>). \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F:\
    <ul>\
    <li><b>record</b> (org.raven.ds.Record) - \u0437\u0430\u043F\u0438\u0441\u044C \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u0430\u044F \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0432\u0440\u0435\u043C\u0435\u043D\u0438</li>\
    </ul>
useSecondaryFieldsExpression#description \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <i>true</i> \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0449\u0435\u0433\u043E \
    \u0441\u0442\u0440\u043E\u043A\u0443 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0431\u0443\u0434\u0435\u0442 \u0432\u0437\u044F\u0442\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <i>secondaryFieldsExpression</i>

cellValueFields#description \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u043E\u043B\u0435\u0439 \u0437\u0430\u043F\u0438\u0441\u0438, \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u044B\u043C\u0438, \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u044F\u0447\u0435\u0439\u043A\u0438 \
    \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442. \
    </p>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0441\u043B\u0443\u0434\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C: \
    <ul>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u043F\u043E\u043B\u044F</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u043E\u043B\u044F</li>\
    <li><i>\u0412 \u0441\u043F\u0438\u0441\u043A\u0435 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u043B\u0435\u0439</i> - \u0441\u0442\u0440\u043E\u043A\u0430 \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0438\u0437 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u044D\u0442\u0438\u0445 \u043F\u043E\u043B\u0435\u0439 \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0437\u0430\u043F\u044F\u0442\u043E\u0439 \u0438 \u043F\u0440\u043E\u0431\u0435\u043B\u043E\u043C</li>\
    <li><i>\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 useCellValueFieldsExpression \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 TRUE</i> - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 cellValueFieldsExpression</li>\
    </ul>
cellValueFieldsExpression#description \u0424\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u044F\u0447\u0435\u0439\u043A\u0438 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \
    \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 (\u0441\u043C. <i>secondaryFields</i>). \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F:\
    <ul>\
    <li><b>record</b> (org.raven.ds.Record) - \u0437\u0430\u043F\u0438\u0441\u044C \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u0430\u044F \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0432\u0440\u0435\u043C\u0435\u043D\u0438</li>\
    </ul>
useCellValueFieldsExpression#description \u0415\u0441\u043B\u0438 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043E \u0432 <i>true</i> \u0442\u043E\u0433\u0434\u0430 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u044F\u0447\u0435\u0439\u043A\u0438 \
    \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u0435 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0431\u0443\u0434\u0435\u0442 \u0432\u0437\u044F\u0442\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <i>secondaryFieldsExpression</i>

firstColumnName#description \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0435\u0440\u0432\u043E\u0439 \u043A\u043E\u043B\u043E\u043D\u043A\u0438 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0438\u0440\u0443\u044E\u0449\u0435\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B