#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041A\u0430\u043D\u0430\u043B (pipe) \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0449\u0438\u0439 \u0437\u0430\u043F\u0438\u0441\u0438 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u043C\u044B\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 (data source)
@class#description \u041A\u0430\u043D\u0430\u043B (pipe) \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0449\u0438\u0439 \u0437\u0430\u043F\u0438\u0441\u0438 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u043C\u044B\u0445 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 (data source). \
    <p>\
    \u0421\u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0437\u0430\u043F\u0438\u0441\u044C \u043C\u043E\u0436\u043D\u043E \u0432 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0438 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>expression</b> (\u043F\u0440\u0438 \u044D\u0442\u043E\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <b>useExpression</b> \u0434\u043E\u043B\u0436\u043D\u043E \u0438\u043C\u0435\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>true</b>), \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0432 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \
    <b>record</b>.\
    <br>\u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440: <i>record['field_name']='field_value'</i>\
    <p/>\
    \u0422\u0430\u043A \u0436\u0435 \u0432 \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0443\u0437\u043B\u0430 \u0432\u0445\u043E\u0434\u0438\u0442 \u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0441\u0435\u0441\u0441\u0438\u043E\u043D\u043D\u044B\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043E\u0432 \u0434\u043B\u044F \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 \
    \u0434\u0430\u043D\u043D\u044B\u0445. \u0421\u0434\u0435\u043B\u0430\u0442\u044C \u044D\u0442\u043E \u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0432 \u0443\u0437\u0435\u043B, \u043E\u043F\u0438\u0441\u044B\u0432\u0430\u044E\u0449\u0438\u0439 \u0441\u0435\u0441\u0441\u0438\u043E\u043D\u044B\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442, \u0432\u043D\u0443\u0442\u0440\u0438 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0443\u0437\u043B\u0430 \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F: \
    <ul>\
    <li><b>data</b> - \u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u043D\u044B\u0435 \u043E\u0442 \u0438\u0441\u0442\u043E\u0447\u043D\u0438\u043A\u0430 (data source)</li>\
    <li><b>record</b> - \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u0435\u043C\u0430\u044F \u0437\u0430\u043F\u0438\u0441\u044C</li>\
    </ul>
