#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class \u041F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0435\u0442 \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0435 \u0442\u0430\u0431\u043B\u0438\u0447\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u0437\u0430\u043F\u0438\u0441\u0438 \u0438 \u043F\u0435\u0440\u0435\u0441\u044B\u043B\u0430\u0435\u0442 \u0438\u0445 \u0441\u0432\u043E\u0438\u043C \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C
@class#description \u041F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0435\u0442 \u0442\u0430\u0431\u043B\u0438\u0447\u043D\u044B\u0435 \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u0432 \u0437\u0430\u043F\u0438\u0441\u0438 \u0438 \u043F\u0435\u0440\u0435\u0441\u044B\u043B\u0430\u0435\u0442 \u0438\u0445 \u0441\u0432\u043E\u0438\u043C \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C. \
    \u0414\u043B\u044F \u0442\u043E\u0433\u043E \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u0442\u044C \u0441\u0442\u0440\u043E\u043A\u0438 \u0442\u0430\u0431\u043B\u0438\u0446\u044B \u0432 \u0437\u0430\u043F\u0438\u0441\u0438 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E: \
    <ul> \
    <li>\u043F\u043E\u043B\u044F\u043C \u0441\u0445\u0435\u043C\u044B \u0434\u043E\u0431\u0430\u0432\u0438\u0442\u044C \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 <i>TableColumnRecordFieldExtension</i> </li> \
    <li>\u0434\u043E\u0432\u0435\u0440\u0448\u0438\u0442\u044C \u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044E \u0437\u0430\u043F\u0438\u0441\u0438 (\u0435\u0441\u043B\u0438 \u0432 \u044D\u0442\u043E\u043C \u0435\u0441\u0442\u044C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0441\u0442\u044C) \u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0432 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \
        \u0432 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0435 <i>configureRecordExpression</i></li> \
    </ul> \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <b>expression</b> \u0443\u0437\u043B\u0430 <b>ValuePrepareRecordFieldExtension</b>): \
    <ul>\
    <li><b>row</b> - \u0442\u0435\u043A\u0443\u0449\u0430\u044F \u0441\u0442\u0440\u043E\u043A\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u044B. \u0422\u0438\u043F - \u043C\u0430\u0441\u0441\u0438\u0432 \u043E\u0431\u044A\u0435\u043A\u0442\u043E\u0432 (Object[]) </li>\
    </ul>

recordSchema#description \u0421\u0445\u0435\u043C\u0430 \u0437\u0430\u043F\u0438\u0441\u0438 \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0447\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u044E\u0442\u0441\u044F
tableColumnExtensionName#description \u0418\u043C\u044F \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0439 (TableColumnRecordFieldExtension). \u0415\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \
    \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E \u0442\u043E\u0433\u0434\u0430 \u0431\u0443\u0434\u0443\u0442 \u0431\u0440\u0430\u0442\u044C\u0441\u044F \u043F\u0435\u0440\u0432\u044B\u0435 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 \u0441 \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u044B\u043C \u0442\u0438\u043F\u043E\u043C (\u0435\u0441\u043B\u0438 \u0442\u0430\u043A\u0438\u0445 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E)
configureRecordExpression#description \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u044D\u0442\u043E\u0433\u043E \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u043E \u043A\u0430\u043A \u0434\u0430\u043D\u043D\u044B\u0435 \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \
    \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u044B \u043F\u043E\u0442\u0440\u0435\u0431\u0438\u0442\u0435\u043B\u044F\u043C \u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0432 \u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u0435\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 \
    <i>useConfigureRecordExpression</i> <b>true</b>. \
    <p/>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430: \
    <ul> \
    <li><b>record</b> (org.raven.ds.Record) - \u0437\u0430\u043F\u0438\u0441\u044C \u0441\u043E\u0437\u0434\u0430\u043D\u043D\u0430\u044F \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u0441\u0442\u0440\u043E\u043A\u0438 \u0442\u0430\u0431\u043B\u0438\u0446\u044B </li>\
    <li><b>row</b> (Object[]) - \u0442\u0435\u043A\u0443\u0449\u0430\u044F \u0441\u0442\u0440\u043E\u043A\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u044B </li>\
    </ul>
useConfigureRecordExpression#description \u0412\u043A\u043B\u044E\u0447\u0430\u0435\u0442 (\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>true</b>) \u0438\u043B\u0438 \u0432\u044B\u043A\u043B\u044E\u0447\u0430\u0435\u0442 \
    (\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 <b>false</b>) \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <b>configureRecordExpression</b>