#  Copyright 2009 Mikhail Titov.
# 
#  Licensed under the Apache License, Version 2.0 (the "License");
#  you may not use this file except in compliance with the License.
#  You may obtain a copy of the License at
# 
#       http://www.apache.org/licenses/LICENSE-2.0
# 
#  Unless required by applicable law or agreed to in writing, software
#  distributed under the License is distributed on an "AS IS" BASIS,
#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#  See the License for the specific language governing permissions and
#  limitations under the License.
#  under the License.

@class#description \u0423\u0437\u0435\u043B \u0432\u043D\u0443\u0442\u0440\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0438\u043B\u0430, \u0432\u043B\u0438\u044F\u044E\u0449\u0438\u0435 \u043D\u0430 \u043F\u0440\u043E\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 (\u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A). \
    <p/>\
    <b>\u041A\u043E\u0433\u0434\u0430 \u0441\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u044E\u0442 \u043F\u0440\u0430\u0432\u0438\u043B\u0430?</b>: \
    <ul> \
    <li>\u041F\u0435\u0440\u0434\u043F\u043E\u043B\u043E\u0436\u0438\u043C \u0447\u0442\u043E \u043F\u0443\u0442\u044C (\u043A\u043B\u044E\u0447) \u043F\u043E \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u0434\u0430\u043D\u043D\u044B\u0435 \u0434\u043E\u043B\u0436\u043D\u044B \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C\u0441\u044F <i>/stat/mail/</i></li>\
    <li>\u041F\u0440\u0435\u0434\u043F\u043E\u043B\u043E\u0436\u0438\u043C \u0447\u0442\u043E \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438 <i>count</i></li>\
    <li>\u0422\u043E\u0433\u0434\u0430 \u043F\u0435\u0440\u0435\u0434 \u0442\u0435\u043C \u043A\u0430\u043A \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0430 \u0431\u0443\u0434\u0435\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0430 \u0431\u0443\u0434\u0443\u0442 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u044B \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0448\u0430\u0433\u0438: \
        <ol>\
        <li>\u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u044B \u0432\u0441\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u043A\u043B\u044E\u0447\u0443 <i>/mail/</i></li>\
        <li>\u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u044B \u0432\u0441\u0435 \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u043A\u043B\u044E\u0447\u0443 <i>/mail/stat/</i></li>\
        <li>\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438 <i>count</i> \u0431\u0443\u0434\u0435\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u043E \u0432 \u0411\u0414 (<font color="red">\u0435\u0441\u043B\u0438 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u043D\u0435 \u0431\u0443\u0434\u0435\u0442 \
            \u043E\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u0430 \u0441\u043E\u043E\u0442\u0432\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u043C \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C)</font></li>\
        </ol>\
    </li>\
    </ul>\
    <p/>\
    <b>\u041A\u0430\u043A \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u043E?</b>: \
    <ul> \
    <li>\u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0443\u0437\u0435\u043B \u0432\u043D\u0443\u0442\u0440\u0438 \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u0432\u044B\u0431\u0440\u0430\u0432 \u0442\u0438\u043F \u043E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u043F\u0440\u0430\u0432\u0438\u043B</li>\
    </ul>\
    <p/>\
    <b>\u041A\u0430\u043A \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u0442\u0430\u043A \u0447\u0442\u043E \u0431\u044B \u043F\u0440\u0430\u0432\u0438\u043B\u043E \u0441\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u043B\u043E \u043F\u0440\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u044B\u0445 \u0443\u0441\u043B\u043E\u0432\u0438\u044F\u0445?</b>: \
    <ul> \
    <li>\u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u0443\u0437\u0435\u043B <i>IfNode</i> \u0437\u0430\u0434\u0430\u0442\u044C \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0449\u0435 \u0443\u0441\u043B\u043E\u0432\u0438\u0435 \u043F\u0440\u0438 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \
        \u0434\u043E\u043B\u0436\u043D\u043E \u0441\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u043E (\u0432 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u043C\u043E\u0436\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u043D\u044B\u0435 \u043D\u0438\u0436\u0435) \
    </li>\
    <li>\u0421\u043E\u0437\u0434\u0430\u0442\u044C \u043F\u0440\u0430\u0432\u0438\u043B\u043E \u0432\u043D\u0443\u0442\u0440\u0438 \u0443\u0437\u043B\u0430 <i>IfNode</i></li>\
    </ul>\
    <p/>\
    <b>\u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0435 \u0434\u043B\u044F \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u0430 <i>expression</i> \u0443\u0437\u043B\u0430 <i>IfNode</i>:\
    <ul>\
    <li><b>key</b> (String) - \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043A\u043B\u044E\u0447 (\u043F\u0443\u0442\u044C) \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438. \u0412 \u043D\u0430\u0448\u0435\u043C \
        \u043F\u0440\u0438\u043C\u0435\u0440\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u044D\u0442\u043E\u0439 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u043C\u0435\u043D\u044F\u043B\u043E\u0441\u044C \u043D\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F: \
        <i>/mail/</i>, <i>/mail/stat/</i></li>\
    <li><b>name</b> (String) - \u0438\u043C\u044F \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u043E\u0439 \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438. \u0412 \u043D\u0430\u0448\u0435\u043C \u043F\u0440\u0438\u043C\u0435\u0440\u0435 \
        \u044D\u0442\u043E <i>count</i> </li>\
    <li><b>value</b> (Double) - \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438</li>\
    <li><b>record</b> (org.raven.statdb.StatisticsRecord) - \u0437\u0430\u043F\u0438\u0441\u044C \u0441\u0442\u0430\u0442\u0438\u0441\u0442\u0438\u043A\u0438</li>\
    </ul>